##############數值型態#################
#numeric 浮點數

a=8.5

class(a)

#interge 整數

a=8
class(a)

a=8L
class(a)



################運算子################
##1.基礎數學運算子

3+4     #加
10-2    #減
3*7     #乘
144/12  #除
2^4     #指數

78%%10  #餘數 
78%/%10  #商數 

##2. 邏輯運算子(TRUE /FALSE)

3<4    #小於
10>8   #小於
5==6   #等於
5!=6   #不等於
10>=8  #大於等於
10<=8  #小於等於
!5==4  #邏輯反轉

58 %in%  c(100:1000)  #交集，包含


##3. 特殊算數運算子 (矩陣乘法)

A = matrix(rep(c(1,2,3),2),nrow = 2,byrow=F)
B = matrix(rep(c(4,5,6),2),nrow = 3,byrow=T)

A %*% B  #矩陣內積乘法
A %o% B  #矩陣外積乘法
A %x% B  #矩陣 Kronecker 乘法


##4. 矩陣轉置

t(A)

