########### factor 使用#####################

#新建資料

Data <- c("男","女","男","女","男","女","男","女","男","女")

class(Data)

Data <- factor(Data)

class(Data)



##轉換成有大小順序
Data <-  c("11~15","15~24","25~28","<10","<10")

factor(Data, levels = c("<10","11~15","15~24","25~28"), ordered = T)


# 更名
Data <-  c("11~15度","15度~24度","0度~10度","25度~28度","28度~33度","超過33度")
DT <- factor(Data,
               levels= c("0度~10度","11~15度","15度~24度","25度~28度","28度~33度","超過33度"),
               labels=c("寒流","強烈冷氣團","清爽溫度","溫度適中","微暖","炎熱"))

